# Используйте официальный образ OpenJDK 21 (выберите нужную вариацию: slim или jdk-slim)
FROM openjdk:21-slim

# Аргумент, определяющий путь к jar-файлу, сгенерированному после сборки Maven
ARG JAR_FILE=target/migomed.jar

# Скопируйте jar-файл из каталога сборки контейнера в корень файловой системы контейнера под именем app.jar
COPY ${JAR_FILE} app.jar

# Задайте переменную окружения с портом (если необходимо)
ENV PORT=8080

# Откройте нужный порт
EXPOSE ${PORT}

# Определите команду, которая будет запущена при старте контейнера
ENTRYPOINT ["java", "-jar", "/app.jar"]
